<style>
    table, th, td {
  border: 1px solid black;
  border-collapse: collapse;
}
</style>
<h2>Forsaken World Question</h2>
<body>
ป้อนเฉพาะส่วนต้นของคำถาม 2-3 คำ<br>
ป้อนคำถาม : <input type="text" id="question" style="width: 30em"/><br>
<button onclick="search()">ค้นหา</button>
<p id="tes"></p>
<table id="Answer"></table>
</body>
<script>
var qa = [
    { question: "ในเทพนิยายกรีก โพรมีธีอุสได้นำพาสิ่งใดมาสู่โลกของมนุษย์", answer: "ไฟ" },   
    { question: "ชาวไวกิงมักถูกกล่าวว่าเป็นอาชีพอาชญากรประเภทใด", answer: "โจรสลัด" },
    { question: "เลือดของกุ้งมังกรเป็นสีอะไร", answer: "สีน้ำเงิน" },
    { question: "Back Hawk Down หมายถึงปฏิบัติการทางทหาร...", answer: "โซมาเลีย" },
    { question: "ใครคือเทพีเเห่งชัยชนะ", answer: "วิกตอเรีย" },
    { question: "จังหวัดที่มีประชากรมากที่สุดในไทย", answer: "กรุงเทพมหานคร" },
    { question: "ยาสลบทำจากอะไร", answer: "คลอโรฟอร์ม" },
    { question: "ข้อใดต่อไปนี้เป็นสำนักข่าวของประเทศฝรั่งเศส", answer: "Agence France-Presse" },
    { question: "อวัยวะที่สามารถล้างพิษได้ในร่างกายของมนุษย์คือ", answer: "ตับ" },
    { question: "พีระมิดสุริยันตั้งอยู่ที่ไหน", answer: "เม็กซิโก" },
    { question: "ดารานำชายในเรื่อง เเฮร์รี่พอตเตอร์ คือใคร", answer: "เเฮร์รี่ พอตเตอร์" },
    { question: "ข้อใดต่อไปนี้คือเเฮร์รี่พอตเตอร์", answer: "หนุ่มชายชาวอังกฤษ"},
    { question: "คะเเนนการเสิร์ฟเทนนิสเรียกว่าคะเเนนอะไร", answer: "Aceball"},
    { question: "ผลผลิตอะไรทำให้เวเนซุเอลารวยที่สุดในประเทศอเมริกาใต้", answer: "น้ำมัน"},
    { question: "คำว่า Trick or Treat เกี่ยวข้องกับเทศกาลใด", answer: "วันฮาโลวีน"},
    { question: "สัตว์ประจำชาติของประเทศไทยคือสัตว์อะไร", answer: "ช้าง"},
    { question: "ผู้ประดิษฐ์ iPhone คือใคร", answer: "สตีฟ จอบส์"},
    { question: "ข้อใดต่อไปนี้ไม่ใช่เผ่าพันธ์ุใน เวิลด์ออฟวอร์คราฟต์", answer: "เซิร์ก"},
    { question: "สัตว์เลี้ยงลูกด้วยนมที่มีอายุยืนที่สุดคือ", answer: "ช้าง"},
    { question: "การหมุนเวียนของเหรีญญในโลกของเซลดา...", answer: "เงินเฟ้อ"},
    { question: "อาวุธใดต่อไปนี้ไม่ใช่อุปกรณ์ที่ขาดไม่ได้ในยุคกลาง", answer: "คันธนูเเละลูกศร"},
    { question: "ในบรรดาสีต่างๆ สีใดดูดซับความร้อนง่ายที่สุด", answer: "สีดำ"},
    { question: "ในกีฬาบาสเกตบอล ลูกโยนโทษได้กี่คะเเนน", answer: "1 คะเเนน"},
    { question: "ละครประเภทใดใน 4 เรื่องนี้ มีต้นกำเนิดจากอิตาลี", answer: "opera"},
    { question: "ดาวเคราะห์ดวงใดอยู่ใกล้ดวงอาทิตย์ที่สุด", answer: "ดาวพุธ"},
    { question: "บัวหิมะมีสีใด", answer: "สีขาว"},
    { question: "คือก่อนวันคริสต์มาสเรียกว่าอะไร", answer: "คริสต์มาสอีฟ"},
    { question: "คุณธรรมคือความรู้ ...นักคิดท่านใด...", answer: "โสกราตีส"},
    { question: "ในนิยายเรื่อง คนค่อมเเห่งน็อทร์-ดาม คนตีระฆังคือใคร", answer: "กาซีโมโด"},
    { question: "เเรงบันดาลใจในการสร้างไวโอลินคืออะไร", answer: "ฮังดรัม"},
    { question: "สีดำผสมกับสีขาวเป็นสีอะไร", answer: "สีเทา"},
    { question: "ข้อใดต่อไปนี้คือความเร็วที่ต้องการเมื่อยานอวกาศบินรอบโลก", answer: "ควรมเร็วห้องอวกาศที่ 1"},
    { question: "บิกัสโซ มีผลงานภาพวาดที่ได้รับรางวัล สันติภาพ คือ", answer: "นกพิราบเเห่งสันติภาพ"},
    { question: "บัลเลต์ 3 เรื่องหลักคือ... เเละอีกเรื่องใด", answer: "สวอนเลก"},
    { question: "ดาว 12 ดวงที่อยู่บนธงสหภาพยุโรปเป็นสีอะไร", answer: "สีเหลือง"},
    { question: "วันที่ 1 เมษาของทุกปีเป็นวันอะไร", answer: "วันเมษาหน้าโง่"},
    { question: "ใครเป็นคนทำบาดเเผลบนใบหน้าของฮิมูระ...", answer: "คู่หมั้นของยูกิชิโร่ โทโมเอะ"},
    { question: "หัวหน้าทีมที่เป็นฝ่ายตรงข้ามกับออพติมัส...", answer: "เมกะทรอน"},
    { question: "เมืองหลวงของประเทศเวียดนามอยู่ที่ไหน", answer: "ฮานอย"},
    { question: "เมืองใดเป็นเมืองหลวงของบราซิลในอดีต...", answer: "ริโอเดจาเนโร"},
    { question: "ผู้คิดค้น ทฤษฏีสัมพัทธภาพ คือใคร", answer: "ไอน์สไตน์"},
    { question: "ผู้เเต่งการ์ตูน ดราก้อนบอล คือคนประเทศใด", answer: "ญี่ปุ่น"},
    { question: "คุณสมบัติของรูปเรขาคณิตใดที่มีความมั่นคง", answer: "รูปสามเหลี่ยม"},
    { question: "หนึ่งวันมี่ทั้งหมดกี่วินาที", answer: "86,400 วินาที"},
    { question: "ตัวตนของลูซิเฟอร์คือ", answer: "นางฟ้าตกสวรรค์"},
    { question: "ขนนก ลูกเหล็กเเละกระดาษ...อันไหนจะลงพื้นก่อน", answer: "ลูกเหล็ก"},
    { question: "เเหลมกู๊ดโฮปตั้งอยู่ที่ไหน", answer: "แอฟริกา"},
    { question: "การเเข่งขันฟุตบอล Fifa World Cup จัดขึ้นทุกๆกี่ปี", answer: "4 ปี"},
    { question: "เทพเจ้าเเห่งความรักคิวปิดเป็นลูกชายของใคร", answer: "เทพีวีนัส"},
    { question: "ร่างกายมนุษย์มีจำนวนโครโมโซมทั้งหมดกี่คู่", answer: "23 คู่"},
    { question: "ใครเป็นผู้ประดิษฐ์ตะเกียบอนามัย", answer: "คนญี่ปุ่น"},
    { question: "ประเทศใดมีการถ่ายภาพยนตร์จำนวนมากที่สุดในโลก", answer: "อินเดีย"},
    { question: "ในอนิเมะเรื่อง โดราเอม่อน เเต่เดิมโดราเอม่อนเป็นตัวสีอะไร", answer: "สีเหลือง"},
    { question: "โลกในเรื่อง เดอะลอร์ดออฟเดอะริงส์ ชื่ออะไร", answer: "Middle-earth"},
    { question: "รางวัลเเกรมมี่เกี่ยวกับอุตสาหกรรมใด", answer: "ดนตรี"},
    { question: "ส่วนใดในอวัยวะตับความรู้สึกทัเงห้าเป็นส่วนที่หายไปของสฟิงซ๋...", answer: "จมูก"},
    { question: "ฮอลลีวูดอยู่ในประเทศใด", answer: "อเมริกา"},
    { question: "ปลาที่ออกเสียงร้องเหมือนเด็กทารก...", answer: "ปลาซาลามันเดอร์ยักษ์จีน"},
    { question: "ประเทศต้นกำเนิดของมหกรรมกีฬาโอลิมปิกสมัยใหม่คือประเทศใด", answer: "กรีซ"},
    { question: "สัตว์ที่วิ่งเร็วที่สุดบนบกคือสัตว์ชนิดใด", answer: "เสือชีตาห์"},
    { question: "รสชาติที่ชาวคิวบาชอบเป็นพิเศษคือรสอะไร", answer: "หวาน"},
    { question: "ชนชาติใดเริ่มทอผ้าไหมเป็นชาติเเรก", answer: "จีน"},
    { question: "ดาราฮอลลีวูดคนใดรับบทเป็นตัวเอก...จิตพิฆาตโลก", answer: "ลีโอนาร์โด ดีเเคพรีโอ"},
    { question: "เรื่องใดต่อไปนี้ไม่รวม...เช็คสเปียร์", answer: "The Comedy of Errors"},
    { question: "Nike คือเเบรนด์อะไร", answer: "แบรนด์กีฬา"},
    { question: "คุณคือไฟฟ้า คุณคือเเสง คุณคือ...ลักษณะของเทพเจ้าท่านใด", answer: "ซุส"},
    { question: "มดใช้วิธีใดในการสื่อสารกัน", answer: "หนวด"},
    { question: "นักเเต่งเพลงท่านใดถูกขนานนามว่าเป็น ราชาเเห่งไวโอลิน", answer: "ปากานีนี"},
    { question: "โยคะมีต้นกำเนิดในประเทศใด", answer: "อินเดีย"},
    { question: "กำหนดให้วันที่ 1 มกคราคม...เเทนสงกรานต์ในรัชสมัยใด", answer: "รัชกาลที่ 8"},
    { question: "ในเทพนิยายกรีก มีนกอินทรียักษ์มาจิกกินตับของใคร", answer: "โพรมีธีอุส"},
    { question: "ประเทศใดผลิตทองเเดงมากที่สุด", answer: "อเมริกา"},
    { question: "ผลไม้ใดตกใส่หัวนิวตันเเล้ว ...", answer: "แอปเปิ้ล"},
    { question: "ชื่อเต็มของอาวุธ ดาบฟิสิกส์เอกซ์คาลิเบอร์ คืออะไร", answer: "ชะเเลง"},
    { question: "พยัญชนะไทยมีอักษรทั้งหมดกี่ตัว", answer: "44"},
    { question: "วันที่ 14 กุมภาพันธ์ของทุกปีเป็นวันอะไร", answer: "วันวาเลนไทน์"},
    { question: "มะเขือเทศเป็นผักหรือผลไม้", answer: "ผัก"},
    { question: "ในเทพนิยายกรีกใครที่ได้มีฉายาเรียกว่าเทพเจ้าเเห่งสงคราม", answer: "แอรีส"},
    { question: "ปะการังเป็นพืชหรือเป็นสัตว์ทะเล", answer: "สัตว์ทะเล"},
    { question: "ตัวอักษรหลังตัวอักษรภาษาอังกฤษ S คืออะไร", answer: "T"},
    { question: "ประเทศใดที่ออกตราประทับดวงเเรกของโลก", answer: "อังกฤษ"},
    { question: "เเมลงปอใช้อวัยวะส่วนใดของร่างกายเเตะผิวน้ำ", answer: "หาง"},
    { question: "ใครเป็นผู้เขียนเรื่อง วันพีช", answer: "เออิจิโร โอดะ"},
    { question: "Vieta นักคณิตศาสตร์ ที่คิดค้น...เป็นคนประเทศไหน", answer: "ฝรั่งเศษ"},
    { question: "ปูมีทั้งหมดกี่ขา", answer: "8 ขา"},
    { question: "BMW เเบรนด์รถยนต์ชื่อดังมาจากประเทศใด", answer: "เยอรมณี"},
    { question: "สาเหตุการสูญพันธุ์ของไดโนเสาร์คืออะไร", answer: "การโจมตีของดาวเคราะห์น้อย"},
    { question: "เมืองใดในยุโรปที่ถูกขนานนามว่าเป็น เมืองเเห่งสายน้ำ", answer: "เวนิส"},
    { question: "โคล่าเเละสไปรท์เป็นเครื่องดื่มประเภทใด", answer: "เครื่องดื่มอัดลม"},
    { question: "เมืองหลวงของประเทศเกาหลีใต้อยู่ที่ไหน", answer: "โซล"},
    { question: "ช้างจะเจริญเติบโต...ยกเว้นส่วนใดที่ไม่มีการเจริญเติบโต", answer: "ตา"},
    { question: "เหยาหมิงเคยเล่นให้กับทีมใดใน NBA", answer: "ฮิวสตัน รอกเก็ตส์"},
    { question: "เสียง หึ่งๆ ของยุงเกิดจากอะไร", answer: "กระพือปีก"},
    { question: "เมืองใดต่อไปนี้เป็นเมืองในประเทศไทย", answer: "เชียงใหม่"},
    { question: "ทาซานโตขึ้นจากที่ไหน" , answer: "ในป่า"},
    { question: "สัญลักษณ์ของเทศกาลภาพยนตร์นานาชาติเวนิสที่มีชื่อเสียงโด่งดังคือสัตว์ใด", answer: "สิงโต"},
    { question: "ข้อใดต่อไปนี้ไม่ใช่นก" , answer: "ค้างคาว"},
    { question: "ดับลินคือเมืองหลวงของประเทศใดในยุโรป", answer: "ไอร์เเลนด์"},
    { question: "หมากรุกสากลมีตัวหมากรุกทั้งหมดกี่ตัว", answer: "32"},
    { question: "ใครคือคนเเรกที่ค้นพบโลกใหม่ทวีปอเมริกา", answer: "โคลัมบัส"},
    { question: "ในนิยายเรื่อง Canon of Sherlock Holmes ...ชื่ออะไร", answer: "วัตสัน"},
    { question: "3 ศิลปินเอกเเห่งยุคเรเนสซองส์ได้เเก่...เเละจิตรกรท่านใด", answer: "ราฟาเอล"},
    { question: "หมายเลข 0 ในไพ่ทาโรต์เมเจอร์อาร์คานาหมายความว่าอะไร", answer: "คนโง่"},
    { question: "เพราะอะไรกล้องส่องทางไกลจึงสามารถมองเห็นสิ่งที่อยู่ไกลได้", answer: "การหักเหและกสะท้อนของแสง"},
    { question: "Adidas เเบรนด์กีฬาชื่อดังมากจากประเทศใด", answer: "อเมริกา"},
    { question: "สีใดเป็นสีที่เป็นสัญลักษณ์ความมิภาพของรัสเซีย", answer: "สีน้ำเงิน"},
    { question: "รางวัลออสการ์มีลักษณะอย่างไร", answer: "ตุ๊กตาทอง"},
    { question: "ใครคือคนที่เเต่งงานกับเจ้าชาย...เรื่อง เงือกน้อยผจญภัย", answer: "เจ้าหญิงประเทศเพื่อนบ้าน"},
    { question: "ธนบัตรมีใช้ครั้งเเรกในรัชกาลใด", answer: "รัชกาลที่ 5"},
    { question: "คนใส่เสื้อผ้าสีอะไรที่มีโอกาสถูกยุงกัดมากที่สุด", answer: "สีดำ"},
    { question: "ใครคือผู้ประพันธ์หลักของหนังสือเรื่อง สารานุกรม", answer: "ดีเคอโร"},
    { question: "จังหวัดใดได้ชื่อมีพื้นที่ปลูกปาล์มน้ำมันมากที่สุด", answer: "กระบี่"},
    { question: "เเชปลินเป็นศิลปินภาพยนตร์ตลกที่มีชื่อเสียง เขาเกิดในประเทศใด", answer: "ประเทศอังกฤษ"},
    { question: "เเหล่งกำเนิดหอยเเครงใหญ่ที่สุดของไทยอยู่ในจังหวัดใด", answer: "เพชรบุรี"},
    { question: "ใครเป็นผู้เขียนเรื่อง โดราเอมอน", answer: "ฟูจิโกะ ฟูจิโอะ"},
    { question: "ในร่างกายมนุษย์อวัยวะใดไม่สามารถเกิดมะมะเร็งได้", answer: "หัวใจ"},
    { question: "ในเรื่อง อเวนเจอร์ส องค์กรใดที่รวบรวมเหล่าซูเปอร์ฮีโร่ทุกคน", answer: "ชี.ล.ด์"},
    { question: "ถ้าเคี่ยวเต้าหู้เเห้งเเละถั่วลิสงในเวลาเดียวกันจะเป็นราชาติใด", answer: "แฮม"},
    { question: "เส้นละติจูดที่พลังงานเเสงอาทิตย์ส่งมายังโลกในระยะไกลที่สุดจากเส้นศูนย์สูตรชื่ออะไร", answer: "เส้นทรอปิก"},
    { question: "ผู้ประพันธ์นิยายเรื่อง ตราบาปสีเลือด ... คือใคร", answer: "Hawthrone"},
    { question: "ปลาใดที่สู้กับผู้ใหญ่คนนั้นสองวันสองคืนในเรื่อง เฒ่าผจญทะเล ของเฮวิงเวย์", answer: "ปลามาร์ลิน"},
    { question: "สะพานอะไรเชื่อมเดนมาร์กกับสวีเดน", answer: "สะพานโอเรซุนด์"},
    { question: "บริษัทเอ็กซอนโมบิลคอร์ปอเรชั่นตั้งอยู่ในประเทศใด", answer: "อเมริกา"},
    { question: "คนประเทศใดที่เป็นคนเเรกที่ได้เสนอว่า บุคคลเท่าเทียมกันในเบื้องหน้ากฏหมาย", answer: "คนฝรั่งเศษ"},
    /*{ question: "", answer: ""},
    { question: "", answer: ""},
    { question: "", answer: ""},
    { question: "", answer: ""}*/
    //{ question: "", answer: ""},
    
];

var sameInput = [];

    function search()
    {
        var text = document.getElementById("question").value;
        var tbl = document.getElementById("Answer");
        var tblBody = document.createElement("tbody");

        tbl.innerHTML = "";
        sameInput = [];

        for (i = 0; i < qa.length; i++)
        {
            var condition = qa[i].question.includes(text);
            
            if (condition)
            {
                sameInput.push(qa[i]);
                
            }

           
        }

        document.getElementById("tes").innerHTML = "พบคำถามที่ตรง " + sameInput.length.toString() + " คำถาม";

        for( var j = 0 ; j < sameInput.length ; j++ ){
            var row = document.createElement( "tr" );
            for( var i = 0 ; i < 2 ; i++ ){
                var cell = document.createElement( "td" );
                var cellText = document.createTextNode("Null");
                if(i === 0)
                {
                    cellText.nodeValue = sameInput[j].question;
                }                
                if(i === 1)
                {
                    cellText.nodeValue = sameInput[j].answer;
                }
                cell.appendChild( cellText );
                row.appendChild( cell );
            }

            tblBody.appendChild( row );
        }
        tbl.appendChild( tblBody );
        tbl.setAttribute( "border" , "1" );
    }

</script>
